In [10]:
import mysql.connector
from datetime import date

In [11]:
con = mysql.connector.connect(
    user='root',
    password='Raulaquino@2011',
    host='localhost',
    database='trainee'
)

In [33]:
add_novela = ("INSERT INTO tbNovela "
               "(codigo_novela, nome_novela, data_primeiro_capitulo, data_ultimo_capitulo, horario_exibicao) "
               "VALUES (%s, %s, %s, %s, %s)")

add_novela_problem = ("INSERT INTO tbNovela "
               "(codigo_novela, nome_novela, data_primeiro_capitulo, data_ultimo_capitulo) "
               "VALUES (%s, %s, %s, %s)")
caps = [203, 201, 209, 25]
data_novela_1 = (1, 'Mulheres apaixonadas', date(2003, 2, 17), date(2003, 10, 11), '20:00') #203 cap
data_novela_2 = (2, 'Mulheres de Areia', date(1993, 2, 1), date(1993, 9, 25), '18:00') #201 cap
data_novela_3 = (3, 'Chocolate com Pimenta', date(2003, 9, 8), date(2004, 5, 7)) #209 cap
data_novela_4 = (4, 'Grande Sertão: Veredas', date(2017, 12, 18), date(2018, 1, 13),'22:00') #25 cap

In [13]:
add_ator = ("INSERT INTO tbAtor "
               "(codigo_ator, nome_ator, idade, cidade_ator, salario_ator, sexo_ator) "
               "VALUES (%s, %s, %s, %s, %s, %s)")

data_ator_1 = (1, 'Carlos Brunno', 24, 'Fortaleza', 2400.00, 'M')
data_ator_2 = (2, 'Nityananda Barbosa', 22, 'Maranguape', 10000.00, 'M')
data_ator_3 = (3, 'Joshuel Nobre', 22, 'Maranguape', 8500.00, 'M')
data_ator_4 = (4, 'Monalisa Sousa', 22, 'Londres', 25000.00, 'F')

In [14]:
add_personagem = ("INSERT INTO tbPersonagem "
               "(codigo_personagem, nome_personagem, idade_personagem, situacao_fnanceira_personagem, codigo_ator) "
               "VALUES (%s, %s, %s, %s, %s)")

data_personagem_1 = (1, 'Carlos', 27, 'rico', 1)
data_personagem_2 = (2, 'Daniel', 29, 'pobre', 2)
data_personagem_3 = (3, 'Marcos', 25, 'rico', 3)
data_personagem_4 = (4, 'Joana', 19, 'pobre', 4)

In [34]:
add__capitulo = ("INSERT INTO tbCapitulo "
               "(codigo_capitulo, nome_capitulo, data_exibicao_capitulo) "
               "VALUES (%s, %s, %s)")

In [ ]:
add__novela_personagem = ("INSERT INTO tbNovelaPersonagem "
               "(codigo_personagem, codigo_novela) "
               "VALUES (%s, %s)")

In [16]:
cursor = con.cursor()
# INSERT INTO tbNovela (codigo_novela, nome_novela, data_primeiro_capitulo, data_ultimo_capitulo, horario_exibicao) 
# VALUES (1, 'Mulheres apaixonadas', '2003-2-17', '2003-10-11', '20:00');

# INSERT INTO tbNovela (codigo_novela, nome_novela, data_primeiro_capitulo, data_ultimo_capitulo, horario_exibicao) 
# VALUES (2, 'Mulheres de Areia', '1993-2-1', '1993-9-25', '18:00');

# INSERT INTO tbNovela (codigo_novela, nome_novela, data_primeiro_capitulo, data_ultimo_capitulo) 
# VALUES (3, 'Chocolate com Pimenta', '2003-9-8', '2004-5-7');

cursor.execute(add_novela, data_novela_1)
cursor.execute(add_novela, data_novela_2)
cursor.execute(add_novela_problem, data_novela_3)
cursor.execute(add_novela, data_novela_4)

novela_no = cursor.lastrowid
print(novela_no)

con.commit()
cursor.close()

0

True

In [17]:
cursor = con.cursor()
# INSERT INTO tbAtor (codigo_ator, nome_ator, idade, cidade_ator, salario_ator, sexo_ator)
# VALUES (1, 'Carlos Brunno', 24, 'Fortaleza', 2400.00, 'M')

# INSERT INTO tbAtor (codigo_ator, nome_ator, idade, cidade_ator, salario_ator, sexo_ator)
# VALUES (2, 'Nityananda Barbosa', 22, 'Maranguape', 10000.00, 'M')

# INSERT INTO tbAtor (codigo_ator, nome_ator, idade, cidade_ator, salario_ator, sexo_ator)
# VALUES (3, 'Joshuel Nobre', 22, 'Maranguape', 8500.00, 'M')

# INSERT INTO tbAtor (codigo_ator, nome_ator, idade, cidade_ator, salario_ator, sexo_ator)
# VALUES (4, 'Monalisa Sousa', 22, 'Londres', 25000.00, 'F')

cursor.execute(add_ator, data_ator_1)
cursor.execute(add_ator, data_ator_2)
cursor.execute(add_ator, data_ator_3)
cursor.execute(add_ator, data_ator_4)

novela_no = cursor.lastrowid
print(novela_no)

con.commit()
cursor.close()

0

True

In [18]:
cursor = con.cursor()
# INSERT INTO tbPersonagem (codigo_personagem, nome_personagem, idade_personagem, situacao_fnanceira_personagem, codigo_ator)
# VALUES (1, 'Carlos', 27, 'rico', 1)

# INSERT INTO tbPersonagem (codigo_personagem, nome_personagem, idade_personagem, situacao_fnanceira_personagem, codigo_ator)
# VALUES (2, 'Daniel', 29, 'pobre', 2)

# INSERT INTO tbPersonagem (codigo_personagem, nome_personagem, idade_personagem, situacao_fnanceira_personagem, codigo_ator)
# VALUES (3, 'Marcos', 25, 'rico', 3)

# INSERT INTO tbPersonagem (codigo_personagem, nome_personagem, idade_personagem, situacao_fnanceira_personagem, codigo_ator)
# VALUES (4, 'Joana', 19, 'pobre', 4)

cursor.execute(add_personagem, data_personagem_1)
cursor.execute(add_personagem, data_personagem_2)
cursor.execute(add_personagem, data_personagem_3)
cursor.execute(add_personagem, data_personagem_4)

novela_no = cursor.lastrowid
print(novela_no)

con.commit()
cursor.close()

0

True

In [19]:
cursor = con.cursor()
# INSERT INTO tbNovelaPersonagem (codigo_personagem, codigo_novela)
# VALUES (1, 1)

# INSERT INTO tbNovelaPersonagem (codigo_personagem, codigo_novela)
# VALUES (2, 2)

# INSERT INTO tbNovelaPersonagem (codigo_personagem, codigo_novela)
# VALUES (3, 3)

# INSERT INTO tbNovelaPersonagem (codigo_personagem, codigo_novela)
# VALUES (4, 4)

cursor.execute(add__novela_personagem, data_novela_personagem_1)
cursor.execute(add__novela_personagem, data_novela_personagem_2)
cursor.execute(add__novela_personagem, data_novela_personagem_3)
cursor.execute(add__novela_personagem, data_novela_personagem_4)

novela_no = cursor.lastrowid
print(novela_no)

con.commit()
cursor.close()

0

True

In [35]:
week = {0: 'segunda', 1: 'terça', 2: 'quarta', 3: 'quinta', 4: 'sexta', 5: 'sábado', 6: 'domingo'}
# print(date(1999, 1, 25).weekday())